# Nominal / One Hot Encoding

In [1]:
import pandas as pd
from sklearn.preprocessing import OneHotEncoder
encoder=OneHotEncoder()

In [2]:
df=pd.DataFrame({
    'color': ['red','blue','green','blue','green','red']
        })

In [8]:
df.head()

   color
0    red
1   blue
2  green
3   blue
4  green

In [12]:
encoded=encoder.fit_transform(df[['color']]).toarray()

In [13]:
encoder_df=pd.DataFrame(encoded,columns=encoder.get_feature_names_out())

In [14]:
encoder_df

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         1.0          0.0        0.0
4         0.0          1.0        0.0
5         0.0          0.0        1.0

In [16]:
# for new data
encoder.transform([['red']]).toarray()

/opt/conda/lib/python3.10/site-packages/sklearn/base.py:409: UserWarning: X does not have valid feature names, but OneHotEncoder was fitted with feature names
  warnings.warn(

array([[0., 0., 1.]])

In [17]:
import seaborn as sns

In [18]:
df= sns.load_dataset('tips')

In [19]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [26]:
S1=encoder.fit_transform(df[['sex','smoker','time']]).toarray()

In [27]:
new1=pd.DataFrame(S1,columns=encoder.get_feature_names_out())

In [28]:
new1

     sex_Female  sex_Male  smoker_No  smoker_Yes  time_Dinner  time_Lunch
0           1.0       0.0        1.0         0.0          1.0         0.0
1           0.0       1.0        1.0         0.0          1.0         0.0
2           0.0       1.0        1.0         0.0          1.0         0.0
3           0.0       1.0        1.0         0.0          1.0         0.0
4           1.0       0.0        1.0         0.0          1.0         0.0
..          ...       ...        ...         ...          ...         ...
239         0.0       1.0        1.0         0.0          1.0         0.0
240         1.0       0.0        0.0         1.0          1.0         0.0
241         0.0       1.0        0.0         1.0          1.0         0.0
242         0.0       1.0        1.0         0.0          1.0         0.0
243         1.0       0.0        1.0         0.0          1.0         0.0

[244 rows x 6 columns]

# LABEL ENCODING

In [3]:
df.head()

   color
0    red
1   blue
2  green
3   blue
4  green

In [4]:
from sklearn.preprocessing import LabelEncoder
lbl_encoder=LabelEncoder()

In [5]:
lbl_encoder.fit_transform(df[['color']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 0, 1, 2])

In [6]:
lbl_encoder.transform([['red']])

/opt/conda/lib/python3.10/site-packages/sklearn/preprocessing/_label.py:134: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

# ORDINAL ENCODING

In [11]:
from sklearn.preprocessing  import OrdinalEncoder

In [8]:
df=pd.DataFrame({
    'size': ['small','big','medium','big','small','medium']
        })

In [9]:
df.head()

     size
0   small
1     big
2  medium
3     big
4   small

In [14]:
# rank is defined here
encoder=OrdinalEncoder(categories=[['small','medium','big']])

In [13]:
encoder.fit_transform(df[['size']])

array([[0.],
       [2.],
       [1.],
       [2.],
       [0.],
       [1.]])

# TARGET GUIDED ORDINAL ENCODING

In [15]:
df=pd.DataFrame({
    'city': ['New York' , 'London','Paris','Tokyo','New York','Paris'],
    'price': [200,150,300,250,180,320]
})

In [16]:
df

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180
5     Paris    320

In [19]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [20]:
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [21]:
df['city_encoded']=df['city'].map(mean_price)

In [22]:
df[['city','price','city_encoded']]

       city  price  city_encoded
0  New York    200         190.0
1    London    150         150.0
2     Paris    300         310.0
3     Tokyo    250         250.0
4  New York    180         190.0
5     Paris    320         310.0

In [23]:
import seaborn as sns

In [24]:
df=sns.load_dataset('tips')

In [25]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [27]:
mean_bill=df.groupby('time')['total_bill'].mean().to_dict()

In [28]:
mean_bill

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [29]:
df['encoded']=df['time'].map(mean_bill)

In [32]:
df[['time','total_bill','encoded']].head()

     time  total_bill    encoded
0  Dinner       16.99  20.797159
1  Dinner       10.34  20.797159
2  Dinner       21.01  20.797159
3  Dinner       23.68  20.797159
4  Dinner       24.59  20.797159